Repository: turulomio/xulpymoney
Catalog: omegat+-en/OmegaT+/project.tmx
Source language: es
Languages: en

source: Índice de contenido
en: Contents

source: Búsqueda por palabras clave
en: Keywords search

source: ¿Qué es Xulpymoney?
en: What is Xulpymoney?

source: ¿Quien lo está desarrollando?
en: Who are the developers?

source: Este programa ha sido desarrollado por Mariano Muñoz, como un proyecto de I+D para aprender la tecnología XUL y mod_python, pero también para solucionar mis problemas de contabilidad doméstica.
en: This program has been developed by Mariano Muñoz. It's a I+D project to learn the use of XUL and mod_python technology. Morever, it tries to solve my home accounting needs.

source: ¿Que licencia tiene?
en: Which is its license?

source: La licencia de Xulpymoney está basada en código abierto y es GPL v3.
en: Xulpymoney, has an opensource license named GPL v3.

source: El código fuente lo puedes encontrar en la página web del proyecto en http://xulpymoney.sourceforge.net no obstante para bajarte el código puedes utilizar el siguiente comando
en: You can find the code in the project page at http://xulpymoney.sourceforge.net. Nevertheless, you can get use this command to get the last release

source: ¿Cómo puedo contribuir?
en: How can you help me?

source: Instalación
en: Installation

source: Base de datos PostgreSQL
en: Postgresql database

source: Los ficheros pgsql.sql y pgsql.data se encuentran en el código fuente.
en: The files pgsql.sql and pgsql.data are in the source code.

source: Servidor Web Apache
en: Apache Web Server

source: Si no usas gentoo, deberás instalar los programas anteriores y ejecutar
en: If you don't use Gentoo, you must install those programs and run

source: Manual de usuario
en: User manual

source: Entidades bancarias
en: Banks

source: Cuentas
en: Accounts

source: Tarjetas
en: Credit cards

source: Inversiones
en: Investments

source: Fondos de inversión
en: Investments funds

source: Acciones
en: Share

source: Depósitos
en: Deposits

source: Falta desarrollar.
en: Needs to be writen.

source: Informes
en: Reports

source: Conceptos
en: Concepts

source: Datos del Ibex35
en: Ibex35 data

source: Esquema de la base de datos
en: Database schema

source: Soporte
en: Support

source: Aplicaciones
en: Apps

source: INSTRUCCIONES PARA GENTOO -------------------------
en: GENTOO INSTRUCTIONS -------------------

source: En el /etc/conf.d/apache poner -D PYTHON
en: You must put in /etc/conf.d/apache: -D PYTHON

source: Se debe configurar el mod_python en /etc/apache2/vhosts.d/default_vhost.include
en: You must configure mod_python at /etc/apache2/vhosts.d/default_vhost.include

source: Modificar las opciones en /etc/xulpymoney/config.py habiendolo copiado de /etc/xulpymoney/config.py.distrib y dandole los permisos apropiados por ejemplo apache:root
en: You must edit your options at /etc/xulpymoney/config.py after copying it from /etc/xulpymoney/config.py.distrib, giving it apropiated permissions, for example, apache:root

source: Entrar en Mozilla Firefox (No funciona con otros navegadores) y poner http://localhost/xulpymoney/index.psp
en: Run Mozilla Firefox (You can't use other browsers) and open http://localhost/xulpymoney/index.psp

source: Xulpymoney 0.1 20100605 ======================= - Funcionalidades básicas del programa - Primera versión
en: Xulpymoney 0.1 20100605 ======================= - Basic funcionality - First version
